package com.lm.jbm.utils;

import java.util.ArrayList;
import java.util.Arrays;
import java.util.List;
import java.util.Random;
import java.util.concurrent.ConcurrentHashMap;

import org.apache.commons.lang.StringUtils;

public class RandomUtil {
	public static ConcurrentHashMap<String, Integer> nameMap = new ConcurrentHashMap<String, Integer>(512);
	public static ConcurrentHashMap<String, String> remarkMap = new ConcurrentHashMap<String, String>(512);
	public static ConcurrentHashMap<String, String> briMap = new ConcurrentHashMap<String, String>(512);
	public static List<String> NOTHING_USER_1 = new ArrayList<String>();
	public static List<String> NOTHING_USER_2 = new ArrayList<String>(); 
	public static List<String> NOTHING_USER_3 = new ArrayList<String>(); 
	public static List<String> NOTHING_USER_4 = new ArrayList<String>(); 
	public static ConcurrentHashMap<String, String> nothingMap = new ConcurrentHashMap<String, String>(512);
	
	public static String[] remark = {"美美哒~~","么么哒!~~","不离不弃","永远爱你！","哈哈哈哈~","再见","明年会改变","不要不理我", "滚","真特么的曹蛋","有本事你别走","来啊，干","什么瘠薄玩意","大理司招生","千言万语",
			"晴儿美美的","小傻瓜","爱不够啊","心相随","你不走我就留","期待！！！","无形无影","天天睡懒觉，日日更健康","五十度","天哥不只是说说的，你看吧","大言不惭，本人都懒得屌你","真是煞笔，什么人都有","恶心到我了，啥x",
			"mt有真美女么？","大哥果然在很豪爽，哈哈哈哈","留下人来，你走开","那个妹子，哥哥好喜欢","新人我喜欢","别来烦我"};
	public static String[] one = {"趁虚而入","空山心雨","云淡风轻","青冘","朴亦","风软一江水","慵","孤星","十八里街禁","既然无缘","野爹",
			"大白牙生快","伯人心贤","南同学","清决","弹指丶红颜老","天与橙","网黑","好演技","浪人叔","黑市","念念不忘","元气鹿","呻吟启蒙师",
			"逢场作戏","永远的过客","服软","征骨岁月","高冷怪","榆西","有味叔","掏空左右","青袂宛约","后会无期","释怀","若即若離","花落成雨",
			"小情绪，难控制","终年不遇","鹿屿","枪手","撒哇嘀咔","滴·好人卡","你是个好人","一婊人才","抚菊圣手","借我一百块","摸胸算命","学弟°",
			"职业捐精户","浪荡先森","大龄男青年","一屁崩死你","本皇只要你"
			,"十分.喜欢","火星机器猫","骞骞","诸葛不亮","一梦庄周","北雅图","缘@起","如烟?勿忘我","十秒多重性格","撸啦撸啦咧ミ","你侧漏了！","此号已作废!~",
			"-騎士精神°","拒絕愛妹@","愛情、不過如此。","好了不見面。","寂寞是空虛的","淺淺の遺忘","孤獨病°","念挂V°","收皂角豆一光宇","?欢迎小情人?",
			"我为你偷桃","小游客。一个","微儿余生都是你","思“情”","宠韵儿之哔哔","??朵儿??小单","白色恋人〖耳朵〗","?宠夏上天","雅丽232",
			"、如烟苞米地","来生的一次回眸","只爱、嘉兴","一米阳??光","别玩、哥带你回家","薇薇、你是我的爱","抱歉、打扰","、缘分天空","尘哥^",
			"唯宠阎sir","温柔女神么么哒〖瓶盖〗ざ歐陽","国民初恋_平∞平","丧彪．有球","℡熊猫","﹏夏心惟微8","哥的【世界】","瓶盖兒的我厨师","风中一粒沙","欧阳雯orange","唯爱晴↘Only","SHCM退出","火力全开要来到",
			"为了那片云","涩女痒","【珂】她的字母。","SHCM小雅。","学长，，，","【追梦】小十","大吉","ソ聚义堂ソOH","()她","【土匪大队】老外","返老OH还童","苏苏唯爱岚儿","中神通王重阳v","口臭妞()丑","狼行十天下",
			"MK小猴V","凤凰小妮","缘来如此","乐﹎乐╮小公主","乐﹎乐╮baby_girlz","橘园深处觅又青","德华哥","单纯的小小鱼","名门世家","我爱你","张二愣子","凤凰涅槃相公","王⑧蛋","凤凰涅槃66","大雪无痕"
			};
	public static String[] two = {"未来不会来","心还没死透","何必执着","再见如陌","归无期","一别便不再见","趴趴树","初衷","心在流浪","错觉","好久不见°","奶凶"
			,"天屎","怪我了","大酋长","鲁汉","小明","韩少","凉凉","哎坡","男芳","青尤","瓜皮","杰哥","今非昔比","怂爷","柠萌","白日萌","锅盖头","晓A",
			"今晚毛毛雨","爱过·放手了","别问我来过","老大叔","碰个瓷","捡漏","疏通下水道","飞过","穷鸟","袍哥","果二","仞刃","大刀肩上扛","5米大砍刀","社会我瓜哥",
			"tian瓜","毒瘤","二杆子","高山炊烟","望·无痕","呜呜。。。","噗噗。。。","柯基","社会哈","名臣","洞察","管中窥豹·纹","大炸蟹","客官别走",
			"掌柜","咯名","清明·上·河图","日·久生情","可爱多","7仔","猛如虎","大力丸","20厘米","无名一☞","思念168","你的心只属于我","㊣企鹅㊣",
			"何处惹尘埃","云在飞","杀阡陌陪你去看花","小娇妹389","听听歌(十八)相加","((相约在今夜))","biubiubiu","沉溺深海","倾她城做她王","白鸽沐城记忆","么意思","开心果树林","()爱","那谁！辣了我的",
			"㊣人生若如初见㊣","大叔看戏的",
			"妞ヽ给爷来一个","乡、巴佬进城","鱼&七秒记忆","Xer儿的郭大伟","傻、成神?","MG來看看","?D?南?","?白云成神?","淡.定86","烧烤??舞",
			"情?小xin","℡走.雷、","吾爱雷爱吾","雷、微??天下","佛说、不归客??","L雷语馨愿","舞?浪迹天下",
			"唯爱晴↘family","缘来如此","幻沫无语","无意思","会陪你一直玩下去的","小小烟火退网啦勿扰","繁华」","琳儿爱吃胡萝卜","⑥⑨⑨⑨⑨⑨⑨⑨",
			"求交往x7089","婧婧☆思密达","琳儿轩叔ぐ","长路漫漫伴你闯","为你装饰","逮丫头当媳妇","温煦仔仔","炮火伴珍惜春夏秋冬",
			"下凡前你是哪位花仙子","谷醉元帅","●家§⊙§童●","陕西：强哥","婷婷家铁粉","不离……不弃","走到最后还是原点","你是我今生的痛",
			"别惹我脾气不好","2019了升个级吧","开心大叔","头狼哥","凌儿是个小笨猪","梦里思莹","天津红孩儿","吉林仙道彰","宁夏⊿天剑",
			"甘肃止水","海南⊥水影","皈依我丸","楠游民找花","三胖子","暗自迷人","瑶瑶迷人楠","洁妹0.0","跑骚升天尊","可爱的麻球",
			"至尊宝的老爹","中一把，谢谢",".满天飞","任务和欢欢一样难过","龍少钟情妃雪","颖萱谢面具哥哥接生","伊伊:人生如此艰难","冰冰小可爱要坍塌了",

	};
	public static String[] thr = {"大黑仔","我是谁","我在哪","好厉害","啊~疼疼","啊~爽爽","啊~不要",
			"啊~哎哟","啊~来吧","·啊~不来","啊·管你呢","嘿嘿·不黑","小·果粉","大·啊哥","随便·啦","你好呀·","我不好~·","哇塞·大","哇塞·深","哇塞·白","哇塞·。。",
			"厉害·哥","好随便·","欢迎你·","啊·欢迎我","嗯·不欢迎你","啊·到底欢不欢迎","不黑不黑","天天吃豆子","不要吧·","可以的啊·","蜜桃小忠粉",
			"阿四哥","55哥","十三哥","大基哥","看热闹·","那啥啊·","没啥货·","da敞亮","扯·犊子","干·哈咧","拉倒·吧","闹哪样@","忆念-Chen.","我不稀罕i",
			"大表姐·","咋整·","·嗯哪","墨·姬","毛·楞","磕`碜","咯`应","打`狼","得`巴","埋·汰","二牛子","☆安静?∫看戏的","☆安静?∫的思念","心跳的节奏","好艰难啊","Smileヾ独醉","蜜桃第一色独醉","敷衍、怎么演",
			"白鸽沐城记忆","山人","开心果树林","孤独人生","小奶狗来了","利民☆666666","不☆离","《爱猫的》星光","6。1/6？","火影忍","夜、罗刹","唯爱雪儿小天","天明吖","夜、微凉","雪妹儿；",
			"赠予玫瑰-手留余香霧裏看花树欲静而风不止火凤凰其貌飞扬辉哥梦忧幽一一雷哥一天魔.东华霸虎一方一生热爱萌新7101妖孽哪里跑给个第一好不好③磊路过卡哇伊家",
			"真我风采","修心。暂退25号","“豪”","我是土匪，我怕谁","托马斯老鬼","男人的两个好","静静的听歌","完美、西子","抖抖飞飞飞","夜、无痕","゜Supreme。","猴哥，吃柚子","偶尔会撒娇，",
			"燃燃吖～","逗逗逗逗～飞","无情的人","一辈子守护你亲","农民哥哥","李东生宽松","舒服咯美人爱","我爱你，关你什么事","粉丝了哦加油","我小不要欺负我","新发地农产品","东门下鱼","快意恩仇",
			"顺其自然","相思沒有眼泪","苏烟不倒","哎呦打着玩","我是老头，勿扰","笨","笨","⑤②①AAAA9876","酷狗音乐安吉拉","轩有","卐心者萌新409236","我爱你796035","别吵哥≈就听歌","孤傲灬云起","恩宠蓝夕",
			"（我爱你）楠","表妹我最爱了","随便逛逛打发时间","【凉de王炸】脑","19那8年","段公子","呵①呵","小小猫咪","小阿娇。","天天哥的门童","天有宝宝","【颜府】小骚飞","哈哈哈呀哇","【小婷婷】",
			"╰梦琪红☆","看一看.咋滴","11@点点","小@灰兔","灵魂歌手烧饼哥","风神","61/6？。","孤星赶月","霧裏看花","遇上是缘","骚亮》只看不","简丹快乐大苹果","青青小草咯","遇上你是我的神","么么试睡员"
	};
	public static String[] fuhao = {"❤","☜","☝","★","☺","☀","☚","☟","☛","♦","☆","♈","♉",
			"❀","✿","ㅎ","ㅍ","ㅃ","ㅆ","㉵",
			"㉴","㈁","㈀","㈀","㈆","㈊","㊣","☯","✈"};
	public static String[] nogroup = {
			"惦·念","゛微微一笑","人老力不衰","夜跑不点灯","爱·久久","凝神","阿花别跑","強子","笑笑·","放手","邂逅","蜜桃用户","九夜°","芈山妖",
			"美颜相机","小沫°","你是个巨婴吧","秋裤男","不穿毛裤","小子艾",
			"大B哥","小范","从良了啊","目标50桃","台风来了","蛋碎了·","鸡毛掸子","我就来看看",
			"哇塞·好多","浪起来","浪里个浪","大傻子","IA耶`","控°","来`gan了","冰冰·举人","乐得清闲","一起嗨啊","无聊中。。","喵喵控",
			"大闸蟹","西毒·大愣子","安逸哦","破毛病","摸摸哒","么么·变·大","摸摸·变·大","摸摸·乖","大哥没人理","求带飞","库擦","毛腿","飞毛腿","好急默啊","改头换面",
			"折翼","闲了蛋疼","静观美女","只看不说话","随便转转","看~灰机","剁手","走过路过","H高了","大路茬子","野路子","随·变","冰儿好暖","有猿再见","烦。。。","M-萝卜",
			"喵奴","溜了溜了","花花对不起","我不是黑粉","露含","整没了","安静","放开那菇凉","你行你上","安尐","尛·","哎呦呦",
			"墨尐兮","゛尐兜兜","开森","加載中……","南子","皮球","傾城","24k·純爺們","如花你好","邪·",
			"找不着北了","蓝月亮°","嘿·来吧","尐持","星星","若惜〆","瘋了","前蓝","哴","山寨.","光灬年","丶浪","梦醒了",
			"蔸蔸゛","揮靃","蔓延","é魂爷","掱伈","灰烬","農村範","劇蔠R","执·唸","天黑晚安","左手","右手","无名指",
			"小雅","鹏灬鹏","彼岸花","心·锁","歎故人","离咒","島域","偏執","潮范","浪人","旧情","夢一场","情歌","窒息","厭世ˇ","空白·割",
			"淺笑°","平凡","路人乙","跑龙套","陌丶沫","辣条","七鱼","南蛮","坤.哥","萌轩.","颖宝♡","玲珑塔","初来匝道","故人",
			"徐大大@","苏陌","栾瑾","顾柒冉","陈默","小野仔","凯子","月牙","空白纸℡","招搖","符堙","清玄","来这渡劫了","墨尘","松子","慕笛",
			"龙呈宇","十里烟寂","清风·你们开心","U直上","我想静静","点墨","安泰","服э了","雨航","貝.乐·","短·路","莫邪","千缕","花开◎","醉了不愿醒","无忧","固·执",
			"祂·依恋","格子","老炮儿°","碎·瓦片","基熊","分叉","墨鱼仔","嘟嘟·快滴","滴·老人卡","滴·健身卡",
			"滴·打卡","滴·无聊","少侠·留种","空心","浅诺","fai荀","天南海北闯大江","幽美南极圈","真鸡儿累","摆渡人°",".執著",
			"゛范晨","藍几","大秋裤","冉丶","木瑾","沐亽","囧囧","千寻","藍°","小北","皇·妖",
			"口回囧","ら迷茫","柒柒.","蓝泡泡♡","不动如山圣如佛","鱼七主儿","苏果儿","暖暖·小刺","二十一.","暮惜哦~","小祖宗♡","烂好人.","小姐姐好看",
			"襟區","媥秇","界限","信仰。","ゞ累","毁诺","U果","Xx栗子","時光","〤霸道","堂主",
			"ぺ伤","羽化尘","碉·楼","向ㄖ","小懒","破伤风","樱花","殘钰","来了又走","蓝光1880","你懂的","喜提孤岛","中奖用户","男爵","铂爵",
			"我不是大神","悔·过","时光机","缘·粪","披头尸","矢哲","㊣大喇叭","＠小角色","鱼泡眼","◎單男◎","經紀人","蓝月","小鬼","隐身",
			"尐怪獣","有妖气","撕扯","桃☆友","逍灬遥","佌愛","骨云","漁哥","柠檬·一口闷","有你就是晴天","釋懷",
			"撩妹控","木槿","你看不见我","大鸡贼","冷雪","刀召","妖·怪","湿主","湿父","大湿兄","小湿妹","心海","莫·邪","颩·一样的男人","念·念","柒°年","忆の江南",
			"没▼毛病","整那啥","整就整呗","少年°","巨婴","那年又三年","过去已不再゜","冷〤夜","道貌岸然","大眼圈",
			"莫相离","久不遇″","我是谁","我在哪","他想干什么","♀伊雪","冷Se调","墨小邪","戒掉·剁手","小晴天","胸出没","故事与你","不念过去",
			"小花骨朵","言不由衷","小禽兽","爺·24K纯帅","旧人劫","时光凉薄","勿忘初心","菰獨守护","痴迷","废柴一人","南瓜",
			"加载中……","千城墨白","龟太气功波","北港初晴","久旧酒","Mr.伍","伊。冬","潇潇","凹+凸=日","良人","天涯","梓柒","烟凉",
			"未命名","奥特蛋","互撸娃","不二心","不将就","吃藕丑","情未了","维他命","司机等等我","开黑的","键盘侠","阿西八","抠脚·阿加西",
			"闷油瓶","故人叹","炸学校","独守心房","梦及深海","预约余生","好梦分你","明夕何夕","抗蛋走天涯","前门鼓鼓","咕咕",
			"孤影凭栏","旧梦难回","黑巷","社会人","十四","毒药","俗人","㊣经","黑名单","一抹淡然","孤岛别墅","木北","社会表哥","我有大表哥","表哥罩我的"
		};
	public static String[] year = {"1981-","1982-","1983-","1984-","1985-","1986-","1987-","1988-","1989-","1990-","1991-","1992-"};
	public static String[] mounth = {"01-","02-","03-","04-","05-","06-","07-","08-","09-","10-","11-","12-"};
	public static String[] day = {"01","02","03","04","05","06","07","08","09","10","11","12","13","14","15","16","17","18"
			,"19","20","21","22","23","24","25","26","27","28"};
	
	public static String getUserIp(String userId) {
		return null;
	}
	
	public static List<String> getUserIds(String key) {
		String userId = PropertiesUtil.getValue(key);
		if(StringUtils.isNotEmpty(userId)) {
			String[] userIds = userId.split(",");
			return Arrays.asList(userIds);
		}
		return null;
	}

	
	public static String getListener() {
		String listener = PropertiesUtil.getValue("listener");
		if(StringUtils.isNotEmpty(listener)) {
			return listener;
		}
		return "";
	}
	
	public static String getRoomId() {
		String roomId = PropertiesUtil.getValue("roomId");
		if(StringUtils.isNotEmpty(roomId)) {
			String[] roomIds = roomId.split(",");
			int index = new Random().nextInt(roomIds.length);
			return roomIds[index];
		}
		return "";
	}
	
	public static String getPwd() {
		String pwd = PropertiesUtil.getValue("pwd");
		if(StringUtils.isNotEmpty(pwd)) {
			return pwd;
		}
		return "";
	}
	
	public static int getTotal() {
		int total = Integer.parseInt(PropertiesUtil.getValue("total"));
		return total;
	}
	
	public static int getRandom(int minValue,int maxValue)
	{
		int returnValue=minValue;
		new java.util.Random();
		returnValue=(int)((maxValue-minValue)*Math.random()+minValue);
		return returnValue;
	}
	
	
	public static String getNickname(String userId) {
		int type = -1; // 默认不组合
		String name = "";
		boolean isRename = false; // 是否有重命名过
		if(nameMap.containsKey(userId)) {
			type = nameMap.get(userId);
			isRename = true;
		}
		if(isRename) {
			if(type == 0) { //        特殊符号 + 单个字 + 特殊符号
				type = getRandom(1, 7);
			} else if(type == 1) { // 特殊符号 + 单个字 + 特殊符号 + 两个字
				int[] types = {0,3,2,4,6,5};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 2) { // 特殊符号 + 单个字 + 特殊符号 + 三个字
				int[] types = {0,3,1,4,6,5};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 3) { // 特殊符号 + 两个字 + 特殊符号
				int[] types = {0,6,1,4,2,5};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 4) { // 特殊符号 + 两个字  + 特殊符号 + 单个字
				int[] types = {0,3,1,5,6,2};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 5) { // 特殊符号 + 三个字  + 特殊符号
				int[] types = {0,3,1,4,6,2};
				type = types[new Random().nextInt(types.length)];
			} else if(type == 6) { // 特殊符号 + 三个字  + 特殊符号 + 单个字
				int[] types = {0,3,1,5,2,4};
				type = types[new Random().nextInt(types.length)];
			} else {
				getRandom(0, 7);
			}
		} 
		name = getName(type);
		nameMap.put(userId, type);
		return name;
	}
	
	private static String getName(int type) {
		String name = "";
		if(type == 0) { //        特殊符号 + 单个字 + 特殊符号
			name = one[getRandom(1, one.length)];
		} else if(type == 1) { // 特殊符号 + 单个字 + 特殊符号 + 两个字
			name = one[getRandom(1, one.length)];
		} else if(type == 2) { // 特殊符号 + 单个字 + 特殊符号 + 三个字
			name = fuhao[getRandom(1, fuhao.length)];
		} else if(type == 3) { // 特殊符号 + 两个字 + 特殊符号
			name = two[getRandom(1, two.length)];
		} else if(type == 4) { // 特殊符号 + 两个字  + 特殊符号 + 单个字
			name = two[getRandom(1, two.length)];
		} else if(type == 5) { // 特殊符号 + 三个字  + 特殊符号
			name = thr[getRandom(1, thr.length)];
		} else if(type == 6) { // 特殊符号 + 三个字  + 特殊符号 + 单个字
			name = thr[getRandom(1, thr.length)];
		} else { // 特殊符号 + 不需要组合的 + 特殊符号
			name = nogroup[getRandom(1, nogroup.length)];
		}  
		return name;
	}
	
	/**
	 * 如果昵称重复，则再加一些符合
	 * @return
	 */
	public static String reSetNickname(String nickname) {
		return nickname + fuhao[getRandom(1, fuhao.length)];
	}
	
	public static String getRemark(String userId) {
		if(remarkMap.containsKey(userId)) {
			return "";
		}
		String rem = remark[getRandom(0,remark.length)];
		if(StringUtils.isEmpty(rem)) {
			rem = "暂无";
		}
		return rem;
	}
	
	public static String getBrithday(String userId) {
		if(briMap.containsKey(userId)) {
			return "";
		}
		String y = year[getRandom(0, year.length)];
		String m = mounth[getRandom(0, mounth.length)];
		String d = day[getRandom(0, day.length)];
		return y+m+d;
	}
	
}
